# Kids Table â€” Executable SQL Queries (MySQL-Backed)
This notebook allows you to **run all 15 SQL queries directly** against your MySQL `kids` table.

Update your MySQL credentials below, then execute each query cell.

## Install MySQL Connector

In [ ]:
!pip install mysql-connector-python pandas

## Connect to MySQL

In [ ]:
import mysql.connector
import pandas as pd

# ðŸ”§ Update credentials:
HOST = "localhost"
USER = "root"
PASSWORD = "YOUR_PASSWORD"   # <-- UPDATE
DATABASE = "testdb"

# Create connection
conn = mysql.connector.connect(
    host=HOST,
    user=USER,
    password=PASSWORD,
    database=DATABASE
)

print("Connected successfully!")

## Helper: Run SQL and Display as DataFrame

In [ ]:
def run_query(sql):
    return pd.read_sql(sql, conn)

# 1. Basic Queries (Executable)

### List all kids
```sql
SELECT * FROM kids;
```

In [ ]:
run_query('''SELECT * FROM kids;''')

### Find all female kids
```sql
SELECT id, race, country, age, height, weight
FROM kids
WHERE sex = 'FEMALE';
```

In [ ]:
run_query('''SELECT id, race, country, age, height, weight
FROM kids
WHERE sex = 'FEMALE';''')

### Kids older than 12
```sql
SELECT id, race, country, age
FROM kids
WHERE age > 12;
```

In [ ]:
run_query('''SELECT id, race, country, age
FROM kids
WHERE age > 12;''')

### Kids from the USA
```sql
SELECT id, race, age, sex
FROM kids
WHERE country = 'USA';
```

In [ ]:
run_query('''SELECT id, race, age, sex
FROM kids
WHERE country = 'USA';''')

### Kids sorted by height
```sql
SELECT id, race, country, height
FROM kids
ORDER BY height DESC;
```

In [ ]:
run_query('''SELECT id, race, country, height
FROM kids
ORDER BY height DESC;''')

# 2. Intermediate Queries (Executable)

### Average age per race
```sql
SELECT race, AVG(age) AS avg_age
FROM kids
GROUP BY race;
```

In [ ]:
run_query('''SELECT race, AVG(age) AS avg_age
FROM kids
GROUP BY race;''')

### Count kids per country
```sql
SELECT country, COUNT(*) AS total_kids
FROM kids
GROUP BY country;
```

In [ ]:
run_query('''SELECT country, COUNT(*) AS total_kids
FROM kids
GROUP BY country;''')

### Tallest kid per race (ROW_NUMBER)
```sql
WITH ranked AS (
    SELECT id, race, height,
           ROW_NUMBER() OVER (PARTITION BY race ORDER BY height DESC) AS rn
    FROM kids
)
SELECT id, race, height
FROM ranked
WHERE rn = 1;
```

In [ ]:
run_query('''WITH ranked AS (
    SELECT id, race, height,
           ROW_NUMBER() OVER (PARTITION BY race ORDER BY height DESC) AS rn
    FROM kids
)
SELECT id, race, height
FROM ranked
WHERE rn = 1;''')

### Average weight per gender
```sql
SELECT sex, AVG(weight) AS avg_weight
FROM kids
GROUP BY sex;
```

In [ ]:
run_query('''SELECT sex, AVG(weight) AS avg_weight
FROM kids
GROUP BY sex;''')

### Shortest kid per country (ROW_NUMBER)
```sql
WITH ranked AS (
    SELECT id, country, height,
           ROW_NUMBER() OVER (PARTITION BY country ORDER BY height ASC) AS rn
    FROM kids
)
SELECT id, country, height
FROM ranked
WHERE rn = 1;
```

In [ ]:
run_query('''WITH ranked AS (
    SELECT id, country, height,
           ROW_NUMBER() OVER (PARTITION BY country ORDER BY height ASC) AS rn
    FROM kids
)
SELECT id, country, height
FROM ranked
WHERE rn = 1;''')

# 3. Intermediate+ Queries (Executable)

### Rank kids by age inside each race
```sql
SELECT id, race, age,
       ROW_NUMBER() OVER (PARTITION BY race ORDER BY age DESC) AS age_rank
FROM kids;
```

In [ ]:
run_query('''SELECT id, race, age,
       ROW_NUMBER() OVER (PARTITION BY race ORDER BY age DESC) AS age_rank
FROM kids;''')

### Countries with more than 5 kids
```sql
SELECT country, COUNT(*) AS total_kids
FROM kids
GROUP BY country
HAVING COUNT(*) > 5;
```

In [ ]:
run_query('''SELECT country, COUNT(*) AS total_kids
FROM kids
GROUP BY country
HAVING COUNT(*) > 5;''')

### Heaviest kid per race (ROW_NUMBER)
```sql
WITH ranked AS (
    SELECT id, race, weight,
           ROW_NUMBER() OVER (PARTITION BY race ORDER BY weight DESC) AS rn
    FROM kids
)
SELECT id, race, weight
FROM ranked
WHERE rn = 1;
```

In [ ]:
run_query('''WITH ranked AS (
    SELECT id, race, weight,
           ROW_NUMBER() OVER (PARTITION BY race ORDER BY weight DESC) AS rn
    FROM kids
)
SELECT id, race, weight
FROM ranked
WHERE rn = 1;''')

### Gender distribution per race
```sql
SELECT race, sex, COUNT(*) AS count_kids
FROM kids
GROUP BY race, sex
ORDER BY race, sex;
```

In [ ]:
run_query('''SELECT race, sex, COUNT(*) AS count_kids
FROM kids
GROUP BY race, sex
ORDER BY race, sex;''')

### Top 3 tallest kids (ROW_NUMBER)
```sql
WITH ranked AS (
    SELECT id, race, country, height,
           ROW_NUMBER() OVER (ORDER BY height DESC) AS rn
    FROM kids
)
SELECT id, race, country, height
FROM ranked
WHERE rn <= 3;
```

In [ ]:
run_query('''WITH ranked AS (
    SELECT id, race, country, height,
           ROW_NUMBER() OVER (ORDER BY height DESC) AS rn
    FROM kids
)
SELECT id, race, country, height
FROM ranked
WHERE rn <= 3;''')

## Close MySQL Connection

In [ ]:
conn.close()
print('Connection closed.')